Repository: tellurianinteractive/Tellurian.Trains.YardControl.Application
Catalog: YardController.Web/Resources/Messages.*.resx
Languages: da, de, nb, sv

# RouteSet
source: Route {0}-{1} set
da: Togvej {0}-{1} lagt
de: Fahrstraße {0}-{1} eingestellt
nb: Togvei {0}-{1} lagt
sv: Tågväg {0}-{1} lagd

# RouteCleared
source: Route {0}-{1} cleared
da: Togvej {0}-{1} tilbagekaldt
de: Fahrstraße {0}-{1} aufgelöst
nb: Togvei {0}-{1} tilbakekalt
sv: Tågväg {0}-{1} återtagen

source: All routes cleared
da: Alle togveje tilbagekaldt
de: Alle Fahrstraßen aufgelöst
nb: Alle togveier tilbakekalt
sv: Alla tågvägar återtagna

# RouteNotFound
source: No train route found from signal {0} to signal {1}
da: Ingen togvej fundet fra signal {0} til signal {1}
de: Keine Fahrstraße gefunden von Signal {0} nach Signal {1}
nb: Ingen togvei funnet fra signal {0} til signal {1}
sv: Ingen tågväg hittad från signal {0} till signal {1}

# RouteConflict
source: Conflict with locked points: {0}
da: Konflikt med låste sporskifter: {0}
de: Konflikt mit gesperrten Weichen: {0}
nb: Konflikt med låste sporveksler: {0}
sv: Konflikt med låsta växlar: {0}

# PointSet
source: Point {0} set to {1}
da: Sporskifte {0} stillet til {1}
de: Weiche {0} gestellt auf {1}
nb: Sporveksel {0} stilt til {1}
sv: Växel {0} ställd till {1}

# PointNotFound
source: No such point number: {0}
da: Intet sådant sporskiftenummer: {0}
de: Keine solche Weichennummer: {0}
nb: Ingen slik sporvekselnummer: {0}
sv: Inget sådant växelnummer: {0}

# PointInvalidCommand
source: Invalid point command: {0}
da: Ugyldig sporskiftekommando: {0}
de: Ungültiger Weichenbefehl: {0}
nb: Ugyldig sporvekselkommando: {0}
sv: Ogiltigt växelkommando: {0}

# PointLocked
source: Point {0} is locked
da: Sporskifte {0} er låst
de: Weiche {0} ist gesperrt
nb: Sporveksel {0} er låst
sv: Växel {0} är låst

# SelectFromSignal
source: Click a signal to start a route
da: Klik på et signal for at initiere en togvej
de: Auf ein Signal klicken, um eine Fahrstraße zu beginnen
nb: Klikk på et signal for å starte en togvei
sv: Klicka på en signal för att initera en tågväg

# SelectFromSignalWithClearHint
source: Click a signal to start a route, or Ctrl+click a route signal to clear it
da: Klik på et signal for at initiere en togvej, eller Ctrl+klik på første elled sidste signal for at tilbagekalde den
de: Auf ein Signal klicken, um eine Fahrstraße zu beginnen, oder Strg+Klick auf ein Fahrstraßensignal zum Auflösen
nb: Klikk på et signal for å starte en togvei, eller Ctrl+klikk på et togveisignal for å tilbakekalle den
sv: Klicka på en signal för att initiera en tågväg, eller Ctrl+klicka på första eller sista signalen i tågvägen för att återta den

# SelectToSignal
source: From: {0} â€” click destination signal
da: Fra: {0} — klik på målsignal
de: Von: {0} — auf Zielsignal klicken
nb: Fra: {0} — klikk på målsignal
sv: Från: {0} — klicka på slutsignal

source: Show grid
da: Vis gitter
nb: Vis rutenett
sv: Visa rutnät

source: Invert view
nb: Inverter visning

# EditDataFilesHint
source: Edit data files to see live changes
da: Rediger datafiler for at se ændringer direkte
nb: Rediger datafiler for å se endringer direkte
sv: Redigera datafiler för att se ändringar direkt

source: Query point states
da: Forespørg sporskiftetilstande
nb: Forespør sporvekseltilstander
sv: Hämta växellägen

source: Reset all points
da: Nulstil alle sporskifter
nb: Tilbakestill alle sporveksler
sv: Återställ alla växlar

source: All signals stop
da: Alle signaler stop
nb: Alle signaler stopp
sv: Alla signaler stopp
